name: "htdemucs"
backend: "python"

input [
  {
    name: "INPUT"
    data_type: TYPE_FP32
    dims: [ 1, 2, -1 ]
  }
]
output [
  {
    name: "OUTPUT"
    data_type: TYPE_FP32
    dims: [ 1, -1, 2, -1 ]
  }
]

instance_group [{ kind: KIND_GPU }]